app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE ('t'='f')
---
  def index
    @employees = Employee.all

INSERT INTO "employees" ("organisation_id", "fname", "lname", "email", "password_digest", "role", "birthday", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "password_digest" = $1, "updated_at" = $2 WHERE "employees"."id" = $3  [["password_digest", "$2a$12$TzAdu.15DY1Gq8ZpYRVduevNwWDBZR9riWoOTXiJA2WEdhpWxZofi"], ["updated_at", "2021-04-06 04:13:08.498138"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)