app/controllers/organisations_controller.rb

  def index
    @organisations = Organisation.all
---
SELECT "organisations".* FROM "organisations"

  def create
    @organisation = Organisation.new(organisation_params)

    respond_to do |format|
      if @organisation.save
---
INSERT INTO "organisations" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "temporary"], ["created_at", "2021-04-05 05:06:06.576918"], ["updated_at", "2021-04-05 05:06:06.576918"]]

  def update
    respond_to do |format|
      if @organisation.update(organisation_params)
---
UPDATE "organisations" SET "logo" = $1, "updated_at" = $2 WHERE "organisations"."id" = $3  [["logo", "pepe.jpeg"], ["updated_at", "2021-04-06 05:02:41.338562"], ["id", 1]]

  def destroy
    @organisation.destroy
---
DELETE FROM "organisations" WHERE "organisations"."id" = $1  [["id", 7]]

    def set_organisation
      @organisation = Organisation.find(params[:id])
---
SELECT  "organisations".* FROM "organisations" WHERE "organisations"."id" = $1 LIMIT 1  [["id", 7]]