app/controllers/sessions_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."email" = $1 LIMIT 1  [["email", "thienthanh11tclc@gmail.com"]]
---
  def create
    user = Employee.find_by(email: params[:email])